Revit 2024 API
BuiltInFailures.MEPFabricationFailures.FabricationPartNoPartTypeFound Property
 There are no fabrication part types found for the current Configuration and Service. Please select settings and reload the service to create the fabrication part types.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId FabricationPartNoPartTypeFound { get; }
Visual Basic
Public Shared ReadOnly Property FabricationPartNoPartTypeFound As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ FabricationPartNoPartTypeFound {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.MEPFabricationFailures Class
Autodesk.Revit.DB Namespace